Revit 2026 API
FamilyItemFactory.NewRevolution Method
Add a new Revolution instance into the Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Revolution NewRevolution(
	bool isSolid,
	CurveArrArray profile,
	SketchPlane sketchPlane,
	Line axis,
	double startAngle,
	double endAngle
)
Public Function NewRevolution (
	isSolid As Boolean,
	profile As CurveArrArray,
	sketchPlane As SketchPlane,
	axis As Line,
	startAngle As Double,
	endAngle As Double
) As Revolution
public:
Revolution^ NewRevolution(
	bool isSolid,
	CurveArrArray^ profile,
	SketchPlane^ sketchPlane,
	Line^ axis,
	double startAngle,
	double endAngle
)
member NewRevolution :
        isSolid : bool *
        profile : CurveArrArray *
        sketchPlane : SketchPlane *
        axis : Line *
        startAngle : float *
        endAngle : float -> Revolution
Parameters
isSolid Boolean
Indicates if the Revolution is Solid or Void.
profile CurveArrArray
The profile of the newly created revolution. This may contain more than one curve loop. Each loop must be a fully closed curve loop and the loops must not intersect. All loops must lie in the same plane. The loop can be a unbound circle or ellipse, but its geometry will be split in two in order to satisfy requirements for sketches used in extrusions.
sketchPlane SketchPlane
The sketch plane for the revolution. The direction of revolution is determined by the normal for the sketch plane.
axis Line
The axis of revolution. This axis must lie in the same plane as the curve loops.
startAngle Double
The start angle of Revolution in radians.
endAngle Double
The end angle of Revolution in radians.
Return Value
Revolution
If creation was successful the new revolution is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the input argument-profile-is null or empty array.
ArgumentNullException |  Thrown when the input argument-sketchPlane-is null.
ArgumentException |  Thrown when the input argument-sketchPlane-is an invalid sketch plane.
ArgumentNullException |  Thrown when the input argument-axis-is null.
InvalidOperationException |  Thrown when creation is attempted in Conceptual Mass, 2D, or other family where revolutions cannot be created.
InvalidOperationException |  Thrown when the creation failed.
Remarks
This method creates an Revolution in a family document. The Revolution will be rotated the plane of the Revolution profile about the Axis.
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace